import type { PathProperties } from '../types';

export const pathPropertiesPmpLm: PathProperties = {
  slopes: {
    boundaries: [
      727000, 741000, 813000, 978000, 1068000, 1541000, 1741000, 1991000, 2005000, 2085000, 2191000,
      2663000, 2771000, 2894000, 2944000, 3079000, 3333000, 3451000, 3470000, 3856000, 3896000,
      4095000, 4230000, 4306000, 4344000, 4399000, 5559000, 5563000, 5672000, 5747000, 5919000,
      5951000, 6169000, 6636000, 6733000, 7167000, 7449000, 7878000, 8096000, 8205000, 8385000,
      8507000, 8633000, 9053000, 9365000, 9508000, 9666000, 9958000, 10024000, 10154000, 10522000,
      10794000, 10866000, 11823000, 11935000, 12191000, 12291000, 12534000, 12678000, 13260000,
      13434000, 13495000, 14318000, 14726000, 14900000, 15062000, 15152000, 15559000, 15655000,
      16030000, 16120000, 16302000, 16498000, 16733000, 16813000, 17835000, 17960000, 18211000,
      18311000, 18919000, 19244000, 20776000, 21026000, 23176000, 23256000, 23487000, 23987000,
      24737000, 25007000, 25670000, 25944000, 26749000, 27045000, 27209000, 27289000, 27982000,
      28222000, 28935000, 29060000, 29659000, 29799000, 30734000, 31684000, 32409000, 32984000,
      35134000, 35502000, 35699000, 35779000, 36428000, 37228000, 38755000, 39305000, 40022000,
      40122000, 40597000, 40997000, 42081000, 42281000, 42846000, 43071000, 44702000, 45377000,
      46408000, 47013000, 47613000, 48080000, 48555000, 49040000, 49190000, 50221000, 50431000,
      50611000, 51107000, 51621000, 51845000, 55567000, 56601000, 56686000, 58185000, 58338000,
      58909000, 59061000, 59413000, 59488000, 59865000, 59953000, 61293000, 61618000, 61765000,
      61990000, 62272000, 62522000, 62683000, 62921000, 63041000, 63253000, 65674000, 65824000,
      66245000, 66520000, 66560000, 67525000, 67565000, 67840000, 68169000, 68369000, 68753000,
      68878000, 69251000, 69513000, 69885000, 70147000, 70307000, 70445000, 70801000, 70941000,
      71411000, 71611000, 73106000, 73286000, 73960000, 74080000, 74635000, 74795000, 76208000,
      76388000, 76928000, 77088000, 77442000, 77602000, 77976000, 78096000, 78913000, 78953000,
      81129000, 81379000, 82082000, 82986000, 83528000, 83970000, 84968000, 85210000, 87053000,
      87173000, 87985000, 88265000, 88765000, 88925000, 89181000, 89241000, 90263000, 90511000,
      91021000, 91391000, 91783000, 92058000, 92137000, 92412000, 92537000, 92774000, 93062000,
      93249000, 93615000, 93895000, 94480000, 94680000, 96004000, 96129000, 97086000, 97286000,
      97659000, 97934000, 98716000, 99317000, 99907000, 100127000, 100730000, 101198000, 101567000,
      101647000, 103939000, 104201000, 104503000, 105003000, 105224000, 105462000, 107028000,
      107303000, 108295000, 108470000, 108738000, 108963000, 109986000, 110211000, 111134000,
      111684000, 112697000, 114496000, 114696000, 115176000, 115326000, 115511000, 116001000,
      116173000, 116323000, 116667000, 116867000, 117295000, 117445000, 118827000, 118927000,
      119818000, 119918000, 120452000, 120627000, 121144000, 121419000, 122705000, 122830000,
      123188000, 123328000, 123753000, 123965000, 124754000, 124929000, 125588000, 126463000,
      126713000, 126927000, 127311000, 127828000, 128628000, 128801000, 129607000, 130516000,
      130666000, 131132000, 131472000, 131802000, 132002000, 132473000, 132623000, 133037000,
      134107000, 134882000, 135032000, 135516000, 135941000, 136494000, 137234000, 137677000,
      138337000, 139128000, 139328000, 140470000, 140550000, 140875000, 141025000, 141813000,
      141973000, 142417000, 142742000, 143255000, 143580000, 144292000, 144417000, 145358000,
      145483000, 146496000, 146776000, 147148000, 147504000, 147592000, 147837000, 147887000,
      148181000, 148455000, 148495000, 149459000, 149873000, 149948000, 151119000, 151269000,
      152127000, 152402000, 154008000, 154108000, 154833000, 154933000, 155813000, 155913000,
      156653000, 157867000, 159197000, 159586000, 159986000, 161027000, 161427000, 162043000,
      162668000, 162799000, 163074000, 163888000, 164663000, 166176000, 166576000, 167305000,
      167435000, 168203000, 168456000, 169847000, 170059000, 171332000, 171482000, 172751000,
      173026000, 174177000, 174552000, 175213000, 175588000, 176190000, 176665000, 177943000,
      178231000, 178611000, 178739000, 179146000, 179187000, 179553000, 180175000, 180892000,
      181213000, 181714000, 181864000, 182074000, 182264000, 182314000, 182436000, 182664000,
      182714000, 182814000, 183064000, 183114000, 184614000, 184964000, 185064000, 186514000,
      186614000, 186714000, 186814000, 187264000, 189364000, 190064000, 190214000, 190314000,
      190364000, 190564000, 190664000, 190764000, 190864000, 191064000, 191214000, 191314000,
      191414000, 191514000, 192764000, 193014000, 193464000, 193614000, 193664000, 194564000,
      195114000, 195464000, 196014000, 196464000, 197564000, 197934000, 198089000, 198303000,
      198464000, 199614000, 199664000, 200014000, 200064000, 200164000, 200464000, 200514000,
      200564000, 201649000,
    ],
    values: [
      0.0, 7.7, 4.1, 0.0, 3.3, 0.0, 8.4, 4.2, 6.3, 0.0, 9.3, 11.5, 11.3, 0.0, 11.3, 0.0, 6.5, 1.0,
      0.0, 10.0, 0.0, 1.0, 4.0, 0.1, -0.3, 0.1, 0.0, 1.1, 0.0, 1.1, 1.6, 2.0, 0.0, -20.0, 0.0,
      -25.0, 0.0, 3.0, 0.0, 25.0, 0.0, 7.0, 0.0, 16.0, 0.0, -10.0, 0.0, 3.0, 0.0, 8.5, 0.0, -14.5,
      0.0, -10.0, 0.0, -3.1, 0.0, 2.0, 0.0, 14.0, 0.0, -0.5, 0.0, -0.5, 0.0, -15.0, 0.0, -12.0, 0.0,
      -4.0, 0.0, -1.0, 0.0, 13.0, 0.0, 15.0, 0.0, 20.0, 20.6, 20.0, 0.0, 7.0, 0.0, -3.0, 0.0, -6.2,
      0.0, 25.0, 0.0, 11.5, 0.0, 11.5, 0.0, -7.0, 0.0, -5.0, 0.0, -20.0, 0.0, -25.0, 0.0, -18.0,
      0.0, 20.0, 0.0, -3.0, 0.0, 20.0, 0.0, 25.0, 0.0, -25.0, 0.0, -3.0, 0.0, 1.0, 0.0, 17.0, 0.0,
      25.0, 0.0, 16.0, 0.0, -11.0, -10.0, 0.0, 14.0, 0.0, -5.0, 0.0, 1.0, 0.0, 16.0, 0.0, -15.0,
      0.0, 1.0, 2.0, 0.0, -1.4, 0.0, -7.6, 0.0, -1.5, 0.0, 1.5, 0.0, -2.0, 0.0, -15.0, 0.0, -6.0,
      0.0, 4.0, 0.0, 13.5, 0.0, 5.0, 0.0, -1.0, 0.0, -1.0, 0.0, -1.0, 0.0, -1.0, 0.0, -9.0, 0.0,
      -4.0, 0.0, 6.5, 0.0, -4.0, 0.0, 1.5, 0.0, -2.0, 0.0, 3.0, 0.0, -1.5, 0.0, 1.5, 0.0, -2.5, 0.0,
      2.0, 0.0, -2.0, 0.0, 2.0, 0.0, -1.0, 0.0, -2.0, 0.0, 8.0, 0.0, -10.0, 0.0, 7.7, 0.0, -2.0,
      0.0, -5.0, 0.0, 2.0, 0.0, -2.0, 0.0, -0.5, 0.0, 5.7, 0.0, -5.0, 0.0, -5.0, 0.0, -5.0, 0.0,
      4.5, 0.0, -3.0, 0.0, 4.0, 0.0, -4.0, 0.0, 1.0, 0.0, 6.0, 0.0, -5.0, 0.0, -2.5, 0.0, 3.0, 0.0,
      -4.0, 0.0, -2.0, 0.0, 8.5, 0.0, -11.5, 0.0, -2.0, 0.0, 9.0, 0.0, 2.0, 0.0, 11.0, 0.0, 20.0,
      0.0, -2.0, -1.0, 0.0, -9.0, 0.0, -3.0, 0.0, 2.0, 0.0, -4.0, 0.0, 4.0, 0.0, -2.0, 0.0, 2.0,
      0.0, -2.0, 0.0, -9.0, 0.0, 2.0, 0.0, -3.0, 0.0, -6.5, 0.0, 2.0, 0.0, -5.0, -4.0, 0.0, 6.0,
      7.0, 8.0, 0.0, -24.0, 0.0, 7.5, 0.0, 15.0, 0.0, -2.0, 0.0, 3.0, 0.0, -3.0, 0.0, 2.0, 0.0, 8.0,
      0.0, 25.0, 0.0, -12.0, 0.0, 6.0, 0.0, -2.0, 0.0, -4.0, 0.0, 2.0, 0.0, -2.0, 0.0, -15.0, 0.0,
      -2.0, 0.0, 3.0, 0.0, -2.0, -1.0, 0.0, 0.5, 0.0, -3.0, 0.0, -1.0, 0.0, -1.0, 0.0, -1.0, 0.0,
      -4.0, 0.0, 2.0, 0.0, -9.0, 0.0, -11.5, 0.0, -7.5, 0.0, -5.0, -6.0, 0.0, 20.0, 0.0, 4.0, 0.0,
      20.0, 0.0, -5.0, 0.0, 6.0, 0.0, -25.0, 0.0, -9.0, 0.0, -14.6, 0.0, -4.5, 0.0, 4.0, 0.0, -2.0,
      0.0, -13.0, 0.0, 2.0, 0.0, 17.0, 0.0, -2.0, 0.0, -20.0, 0.0, -12.0, 0.0, -12.0, 0.0, -2.1,
      -1.8, -2.1, -1.5, 0.0, -1.5, 0.2, -0.2, 0.0, 0.2, 0.0, 0.4, -0.4, -1.7, -1.2, -2.4, -1.3, 0.0,
      -0.2, 0.0, -0.3, 0.9, 2.2, 1.6, 0.0, 0.4, -0.6, 0.0, 0.5, -0.5, 0.2, -0.2, 0.0, -0.2, 0.1,
      -0.9, -3.1, -4.1, -3.2, -4.8, -3.1, -2.8, -0.8, 0.0, -0.2, -1.8, -1.7, -0.5, -2.6, -1.5, -1.4,
      -2.4, -1.3, 0.6, 2.9, 5.5, 3.8, 1.0, -0.8, 0.0,
    ],
  },
  electrifications: {
    boundaries: [
      7179000, 7767000, 63981000, 64172000, 94149000, 94341000, 131940000, 132132000, 180517000,
      180617000, 181341000, 201544000,
    ],
    values: [
      {
        type: 'electrification',
        voltage: '1500V',
      },
      {
        type: 'neutral_section',
        lower_pantograph: true,
      },
      {
        type: 'electrification',
        voltage: '25000V',
      },
      {
        type: 'neutral_section',
        lower_pantograph: false,
      },
      {
        type: 'electrification',
        voltage: '25000V',
      },
      {
        type: 'neutral_section',
        lower_pantograph: false,
      },
      {
        type: 'electrification',
        voltage: '25000V',
      },
      {
        type: 'neutral_section',
        lower_pantograph: false,
      },
      {
        type: 'electrification',
        voltage: '25000V',
      },
      {
        type: 'neutral_section',
        lower_pantograph: false,
      },
      {
        type: 'electrification',
        voltage: '25000V',
      },
      {
        type: 'electrification',
        voltage: '1500V',
      },
    ],
  },
  operational_points: [
    {
      extensions: {
        ch: 'BV',
        identifier: {
          name: 'Paris-Montparnasse',
        },
        weight: 100,
      },
      position: 0,
    },
    {
      extensions: {
        ch: '00',
        identifier: {
          name: 'Paris-Vaugirard',
        },
        weight: 80,
      },
      position: 341000,
    },
    {
      extensions: {
        ch: 'AV',
        identifier: {
          name: 'Paris-Montparnasse',
        },
        weight: 20,
      },
      position: 1014000,
    },
    {
      extensions: {
        ch: 'AV',
        identifier: {
          name: 'Paris-Montparnasse',
        },
        weight: 20,
      },
      position: 1078000,
    },
    {
      extensions: {
        ch: 'VO',
        identifier: {
          name: 'Paris-Montparnasse',
        },
        weight: 10,
      },
      position: 1900000,
    },
    {
      extensions: {
        ch: '04',
        identifier: {
          name: 'Vanves-Malakoff',
        },
        weight: 0,
      },
      position: 2005000,
    },
    {
      extensions: {
        ch: '04',
        identifier: {
          name: 'Vanves-Malakoff',
        },
        weight: 0,
      },
      position: 2085000,
    },
    {
      extensions: {
        ch: '05',
        identifier: {
          name: 'Vanves-Malakoff',
        },
        weight: 70,
      },
      position: 2332000,
    },
    {
      extensions: {
        ch: 'BI',
        identifier: {
          name: 'Vanves-Malakoff',
        },
        weight: 90,
      },
      position: 2701000,
    },
    {
      extensions: {
        ch: 'AP',
        identifier: {
          name: 'Montrouge-Châtillon',
        },
        weight: 75,
      },
      position: 3856000,
    },
    {
      extensions: {
        ch: 'AP',
        identifier: {
          name: 'Montrouge-Châtillon',
        },
        weight: 15,
      },
      position: 3856000,
    },
    {
      extensions: {
        ch: 'SE',
        identifier: {
          name: 'Montrouge-Châtillon',
        },
        weight: 85,
      },
      position: 3927000,
    },
    {
      extensions: {
        ch: 'SE',
        identifier: {
          name: 'Montrouge-Châtillon',
        },
        weight: 35,
      },
      position: 3943000,
    },
    {
      extensions: {
        ch: 'SE',
        identifier: {
          name: 'Montrouge-Châtillon',
        },
        weight: 10,
      },
      position: 3959000,
    },
    {
      extensions: {
        ch: 'M2',
        identifier: {
          name: 'Montrouge-Châtillon',
        },
        weight: 0,
      },
      position: 4306000,
    },
    {
      extensions: {
        ch: '01',
        identifier: {
          name: 'Montrouge-Châtillon',
        },
        weight: 20,
      },
      position: 4306000,
    },
    {
      extensions: {
        ch: 'AT',
        identifier: {
          name: 'Montrouge-Châtillon',
        },
        weight: 75,
      },
      position: 4331000,
    },
    {
      extensions: {
        ch: 'M2',
        identifier: {
          name: 'Montrouge-Châtillon',
        },
        weight: 65,
      },
      position: 4407000,
    },
    {
      extensions: {
        ch: 'GR',
        identifier: {
          name: 'Montrouge-Châtillon',
        },
        weight: 70,
      },
      position: 4465000,
    },
    {
      extensions: {
        ch: '01',
        identifier: {
          name: 'Montrouge-Châtillon',
        },
        weight: 40,
      },
      position: 4666000,
    },
    {
      extensions: {
        ch: 'AT',
        identifier: {
          name: 'Montrouge-Châtillon',
        },
        weight: 10,
      },
      position: 5338000,
    },
    {
      extensions: {
        ch: 'AT',
        identifier: {
          name: 'Montrouge-Châtillon',
        },
        weight: 20,
      },
      position: 5341000,
    },
    {
      extensions: {
        ch: 'ES',
        identifier: {
          name: 'Montrouge-Châtillon',
        },
        weight: 75,
      },
      position: 5559000,
    },
    {
      extensions: {
        ch: 'ES',
        identifier: {
          name: 'Montrouge-Châtillon',
        },
        weight: 35,
      },
      position: 5563000,
    },
    {
      extensions: {
        ch: 'ES',
        identifier: {
          name: 'Montrouge-Châtillon',
        },
        weight: 50,
      },
      position: 5617000,
    },
    {
      extensions: {
        ch: '01',
        identifier: {
          name: 'Massy-TGV',
        },
        weight: 50,
      },
      position: 11377000,
    },
    {
      extensions: {
        ch: '04',
        identifier: {
          name: 'Massy-TGV',
        },
        weight: 10,
      },
      position: 11457000,
    },
    {
      extensions: {
        ch: '11',
        identifier: {
          name: 'Massy-TGV',
        },
        weight: 70,
      },
      position: 13266000,
    },
    {
      extensions: {
        ch: 'E3',
        identifier: {
          name: 'Massy-TGV',
        },
        weight: 20,
      },
      position: 13495000,
    },
    {
      extensions: {
        ch: 'E3',
        identifier: {
          name: 'Massy-TGV',
        },
        weight: 60,
      },
      position: 13640000,
    },
    {
      extensions: {
        ch: 'BV',
        identifier: {
          name: 'Massy-TGV',
        },
        weight: 80,
      },
      position: 13917000,
    },
    {
      extensions: {
        ch: 'S3',
        identifier: {
          name: 'Massy-TGV',
        },
        weight: 55,
      },
      position: 14284000,
    },
    {
      extensions: {
        ch: '00',
        identifier: {
          name: 'Poste 12 Marcoussis',
        },
        weight: 30,
      },
      position: 24888000,
    },
    {
      extensions: {
        ch: '00',
        identifier: {
          name: 'Poste 13 St-Arnoult',
        },
        weight: 70,
      },
      position: 44154000,
    },
    {
      extensions: {
        ch: 'RA',
        identifier: {
          name: 'Poste 13 St-Arnoult',
        },
        weight: 15,
      },
      position: 55666000,
    },
    {
      extensions: {
        ch: 'BT',
        identifier: {
          name: 'Poste 14 St-Léger',
        },
        weight: 20,
      },
      position: 65984000,
    },
    {
      extensions: {
        ch: '00',
        identifier: {
          name: 'Poste 14 St-Léger',
        },
        weight: 65,
      },
      position: 66757000,
    },
    {
      extensions: {
        ch: '00',
        identifier: {
          name: 'Poste 14 St-Léger',
        },
        weight: 60,
      },
      position: 67322000,
    },
    {
      extensions: {
        ch: '00',
        identifier: {
          name: 'Poste 15 Rouvray',
        },
        weight: 15,
      },
      position: 91839000,
    },
    {
      extensions: {
        ch: '00',
        identifier: {
          name: 'Poste 16 Dangeau',
        },
        weight: 20,
      },
      position: 113593000,
    },
    {
      extensions: {
        ch: 'BI',
        identifier: {
          name: 'Courtalain-TGV-Bifurcation',
        },
        weight: 35,
      },
      position: 129814000,
    },
    {
      extensions: {
        ch: 'BI',
        identifier: {
          name: 'Courtalain-TGV-Bifurcation',
        },
        weight: 30,
      },
      position: 129814000,
    },
    {
      extensions: {
        ch: '17',
        identifier: {
          name: 'Poste 17',
        },
        weight: 30,
      },
      position: 133730000,
    },
    {
      extensions: {
        ch: '00',
        identifier: {
          name: 'Poste 31 Plessis',
        },
        weight: 45,
      },
      position: 149220000,
    },
    {
      extensions: {
        ch: '00',
        identifier: {
          name: 'Poste 32 Dollon',
        },
        weight: 40,
      },
      position: 172330000,
    },
    {
      extensions: {
        ch: 'BP',
        identifier: {
          name: 'Poste 33 Connerré',
        },
        weight: 60,
      },
      position: 178858000,
    },
    {
      extensions: {
        ch: 'BP',
        identifier: {
          name: 'Poste 33 Connerré',
        },
        weight: 55,
      },
      position: 179187000,
    },
    {
      extensions: {
        ch: 'S1',
        identifier: {
          name: 'Connerré-Beillé',
        },
        weight: 90,
      },
      position: 181509000,
    },
    {
      extensions: {
        ch: 'S2',
        identifier: {
          name: 'Connerré-Beillé',
        },
        weight: 10,
      },
      position: 182367000,
    },
    {
      extensions: {
        ch: 'BV',
        identifier: {
          name: 'Montfort-le-Gesnois',
        },
        weight: 25,
      },
      position: 184452000,
    },
    {
      extensions: {
        ch: 'GA',
        identifier: {
          name: 'Montfort-le-Gesnois',
        },
        weight: 15,
      },
      position: 184564000,
    },
    {
      extensions: {
        ch: '00',
        identifier: {
          name: 'St-Mars-la-Brière',
        },
        weight: 20,
      },
      position: 187776000,
    },
    {
      extensions: {
        ch: '00',
        identifier: {
          name: 'Champagné',
        },
        weight: 30,
      },
      position: 190201000,
    },
    {
      extensions: {
        ch: '00',
        identifier: {
          name: "Yvré-l'Évêque",
        },
        weight: 50,
      },
      position: 194664000,
    },
    {
      extensions: {
        ch: 'DO',
        identifier: {
          name: 'Le Mans',
        },
        weight: 10,
      },
      position: 199484000,
    },
    {
      extensions: {
        ch: 'PE',
        identifier: {
          name: 'Le Mans',
        },
        weight: 5,
      },
      position: 200406000,
    },
    {
      extensions: {
        ch: 'BV',
        identifier: {
          name: 'Le Mans',
        },
        weight: 100,
      },
      position: 201649000,
    },
  ],
};
